KanatERPSukhova.КанатАдаптация/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="951a5403-e1a4-4484-8fda-c18df8f291d3">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="e654eb8f-cadf-4ea9-b106-6855158dcb94">
    <name>Работа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fc59acc3-f1f7-4e3f-96da-e580f2c5a88f">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="3d295926-ac21-4f62-b76e-64c929f1fc0e">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_НТДНоменклатуры</name>
    <type>
      <types>CatalogRef.КАНАТ_НТДНоменклатуры</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="0e7e0970-627b-458f-8d96-ef13c523d2b8">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КАНАТКач_ВидДляКонтроляКачества</name>
    <type>
      <types>CatalogRef.КАНАТ_ВидыПродукцииКонтрольКачества</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="722c3d13-753d-4b4f-82b9-d41340f96d79">
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1b521724-19bd-43e6-b544-b67dc4ba22b9">
    <name>ТипНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_ТекстДублиАртикулов</name>
    <comment>#000000054, ЧТЗ_3_8 Артикул=код</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_НеГенерироватьАртикул</name>
    <comment>#000000054, ЧТЗ_3_8 Артикул=код</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="97ef8ff9-68db-45ee-91be-54bfb600b3a1">
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_ОБъектБылИзменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КАНАТ_ПоказателиНТД</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДПоказатели</types>
      </type>
    </attributes>
    <attributes>
      <name>Размерность</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДРазмерности</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отклонение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/CommonForms/СозданиеНаОснованииУточнениеЗаказываемогоКоличества/Module.bsl
&ИзменениеИКонтроль("АдресТовары")
Функция КАНАТ_АдресТовары()
   	Запрос = Новый Запрос(); 
	#Вставка
	Если ТипЗнч(Параметры.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда 
		Запрос.Текст =
			"ВЫБРАТЬ
			|	Товары.НомерСтрокиВДокументе КАК НомерСтрокиВДокументе,
			|	Товары.Номенклатура КАК Номенклатура,
			|	Товары.Характеристика КАК Характеристика,
			|	Товары.Назначение КАК Назначение,
			|	Товары.Упаковка КАК Упаковка,
			|	Товары.КЗаказу КАК КЗаказу,
			|	Товары.Склад КАК Склад,
			|	Товары.Подразделение КАК Подразделение,
			|	Товары.ДатаОтгрузки КАК ДатаОтгрузки,
			|//++ Гурьев 11.09.23 Комментарии к заказу
			|	Товары.КАНАТ_КомментарийКЗаказу КАК КАНАТ_КомментарийКЗаказу,
			|	Товары.КАНАТ_Сертификат КАК КАНАТ_Сертификат
			|//-- Гурьев 11.09.23
			|ПОМЕСТИТЬ Товары
			|ИЗ
			|	&Товары КАК Товары
			|ГДЕ
			|	Товары.КЗаказу > 0
			|ИНДЕКСИРОВАТЬ ПО
			|   Номенклатура
			|;
			|
			|///////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Товары.НомерСтрокиВДокументе КАК НомерСтрокиВДокументе,
			|	Товары.Номенклатура КАК Номенклатура,
			|	Товары.Характеристика КАК Характеристика,
			|	ЕСТЬNULL(СтавкиНДСНоменклатуры.СтавкаНДС, ЕСТЬNULL(ОсновныеСтавкиНДС.СтавкаНДС,
			|		ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка))) КАК СтавкаНДС,
			|	Товары.Назначение КАК Назначение,
			|	Товары.Упаковка КАК Упаковка,
			|	Товары.КЗаказу * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК Количество,
			|	Товары.КЗаказу КАК КоличествоУпаковок,
			|	Товары.Склад КАК Склад,
			|	Товары.Подразделение КАК Подразделение,
			|	Товары.ДатаОтгрузки КАК ДатаОтгрузки,
			|	ВЫБОР КОГДА Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
			|				Товары.Подразделение
			|			ИНАЧЕ
			|				Товары.Склад
			|		КОНЕЦ КАК Получатель,
			|	ВЫБОР КОГДА Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга) ТОГДА
			|			ИСТИНА
			|		ИНАЧЕ
			|			ЛОЖЬ
			|		КОНЕЦ КАК СписатьНаРасходы,
			|//++ Гурьев 11.09.23 Комментарии к заказу
			|	Товары.КАНАТ_КомментарийКЗаказу КАК КАНАТ_КомментарийКЗаказу,
			|	Товары.КАНАТ_Сертификат КАК КАНАТ_Сертификат
			|//-- Гурьев 11.09.23
			|ИЗ
			|	Товары КАК Товары
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК ВсеУпаковки
			|		ПО ВсеУпаковки.Ссылка = Товары.Упаковка
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНДСНоменклатуры.СрезПоследних(&Период,
			|			Страна = &СтранаРегистрации ИЛИ Страна = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) КАК СтавкиНДСНоменклатуры
			|		ПО СтавкиНДСНоменклатуры.Номенклатура = Товары.Номенклатура 
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСтавкиНДС.СрезПоследних(&Период, Страна = &СтранаРегистрации) КАК ОсновныеСтавкиНДС
			|		ПО ИСТИНА
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтрокиВДокументе
			|;
			|
			|////////////////////////////
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА МИНИМУМ(Товары.Склад) = МАКСИМУМ(Товары.Склад)
			|			ТОГДА МИНИМУМ(Товары.Склад)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
			|	КОНЕЦ КАК ОдинСклад
			|ИЗ
			|	Товары КАК Товары
			|ГДЕ
			|	Товары.Склад ССЫЛКА Справочник.Склады И Товары.Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)";
		Иначе
	#КонецВставки

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.НомерСтрокиВДокументе КАК НомерСтрокиВДокументе,
	|	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Назначение КАК Назначение,
	|	Товары.Упаковка КАК Упаковка,
	|	Товары.КЗаказу КАК КЗаказу,
	|	Товары.Склад КАК Склад,
	|	Товары.Подразделение КАК Подразделение,
	|	Товары.ДатаОтгрузки КАК ДатаОтгрузки
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&Товары КАК Товары
	|ГДЕ
	|	Товары.КЗаказу > 0
	|ИНДЕКСИРОВАТЬ ПО
	|   Номенклатура
	|;
	|
	|///////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.НомерСтрокиВДокументе КАК НомерСтрокиВДокументе,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(СтавкиНДСНоменклатуры.СтавкаНДС, ЕСТЬNULL(ОсновныеСтавкиНДС.СтавкаНДС,
	|		ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка))) КАК СтавкаНДС,
	|	Товары.Назначение КАК Назначение,
	|	Товары.Упаковка КАК Упаковка,
	|	Товары.КЗаказу * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК Количество,
	|	Товары.КЗаказу КАК КоличествоУпаковок,
	|	Товары.Склад КАК Склад,
	|	Товары.Подразделение КАК Подразделение,
	|	Товары.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ВЫБОР КОГДА Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
	|				Товары.Подразделение
	|			ИНАЧЕ
	|				Товары.Склад
	|		КОНЕЦ КАК Получатель,
	|	ВЫБОР КОГДА Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|		КОНЕЦ КАК СписатьНаРасходы 
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК ВсеУпаковки
	|		ПО ВсеУпаковки.Ссылка = Товары.Упаковка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНДСНоменклатуры.СрезПоследних(&Период,
	|			Страна = &СтранаРегистрации ИЛИ Страна = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) КАК СтавкиНДСНоменклатуры
	|		ПО СтавкиНДСНоменклатуры.Номенклатура = Товары.Номенклатура 
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСтавкиНДС.СрезПоследних(&Период, Страна = &СтранаРегистрации) КАК ОсновныеСтавкиНДС
	|		ПО ИСТИНА
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтрокиВДокументе
	|;
	|
	|////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА МИНИМУМ(Товары.Склад) = МАКСИМУМ(Товары.Склад)
	|			ТОГДА МИНИМУМ(Товары.Склад)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|	КОНЕЦ КАК ОдинСклад
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(Товары.Склад) = ТИП(Справочник.Склады) И Товары.Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)";
    #Вставка
	КонецЕсли;
	#КонецВставки
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
	"&ТекстЗапросаКоэффициентУпаковки",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"ВсеУпаковки.Ссылка",
	"Товары.Номенклатура"));

	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.Ссылка, "Дата, Организация");
	Запрос.УстановитьПараметр("Товары", Товары.Выгрузить(Новый Структура("Отметка", Истина)));
	Запрос.УстановитьПараметр("ДокументСсылка", Параметры.Ссылка);
	Запрос.УстановитьПараметр("Период", ЗначенияРеквизитов.Дата);
	Запрос.УстановитьПараметр("СтранаРегистрации", ЗначениеНастроекКлиентСерверПовтИсп.СтранаРегистрацииОрганизации(ЗначенияРеквизитов.Организация));

	Результаты = Запрос.ВыполнитьПакет();
	ТаблицаТоваров = Результаты[Результаты.ВГраница() - 1].Выгрузить();
	АдресТовары = ПоместитьВоВременноеХранилище(ТаблицаТоваров);
	Выборка = Результаты[Результаты.ВГраница()].Выбрать();
	ОдинСклад = Справочники.Склады.ПустаяСсылка();
	Если Выборка.Следующий() Тогда
		ОдинСклад = Выборка.ОдинСклад;
	КонецЕсли;

	Возврат Новый Структура("АдресТовары,ОдинСклад", АдресТовары, ОдинСклад);

КонецФункции

//&НаСервере
//&Вместо("АдресТовары")
//Функция КАНАТ_АдресТовары()
//	Запрос = Новый Запрос();
//	Если ТипЗнч(Параметры.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда 
//		Запрос.Текст =
//			"ВЫБРАТЬ
//			|	Товары.НомерСтрокиВДокументе КАК НомерСтрокиВДокументе,
//			|	Товары.Номенклатура КАК Номенклатура,
//			|	Товары.Характеристика КАК Характеристика,
//			|	Товары.Назначение КАК Назначение,
//			|	Товары.Упаковка КАК Упаковка,
//			|	Товары.КЗаказу КАК КЗаказу,
//			|	Товары.Склад КАК Склад,
//			|	Товары.Подразделение КАК Подразделение,
//			|	Товары.ДатаОтгрузки КАК ДатаОтгрузки,
//			|//++ Гурьев 11.09.23 Комментарии к заказу
//			|	Товары.КАНАТ_КомментарийКЗаказу КАК КАНАТ_КомментарийКЗаказу,
//			|	Товары.КАНАТ_Сертификат КАК КАНАТ_Сертификат
//			|//-- Гурьев 11.09.23
//			|ПОМЕСТИТЬ Товары
//			|ИЗ
//			|	&Товары КАК Товары
//			|ГДЕ
//			|	Товары.КЗаказу > 0
//			|ИНДЕКСИРОВАТЬ ПО
//			|   Номенклатура
//			|;
//			|
//			|///////////////////////////////////////////////
//			|ВЫБРАТЬ
//			|	Товары.НомерСтрокиВДокументе КАК НомерСтрокиВДокументе,
//			|	Товары.Номенклатура КАК Номенклатура,
//			|	Товары.Характеристика КАК Характеристика,
//			|	ЕСТЬNULL(СтавкиНДСНоменклатуры.СтавкаНДС, ЕСТЬNULL(ОсновныеСтавкиНДС.СтавкаНДС,
//			|		ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка))) КАК СтавкаНДС,
//			|	Товары.Назначение КАК Назначение,
//			|	Товары.Упаковка КАК Упаковка,
//			|	Товары.КЗаказу * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК Количество,
//			|	Товары.КЗаказу КАК КоличествоУпаковок,
//			|	Товары.Склад КАК Склад,
//			|	Товары.Подразделение КАК Подразделение,
//			|	Товары.ДатаОтгрузки КАК ДатаОтгрузки,
//			|	ВЫБОР КОГДА Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
//			|				Товары.Подразделение
//			|			ИНАЧЕ
//			|				Товары.Склад
//			|		КОНЕЦ КАК Получатель,
//			|	ВЫБОР КОГДА Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга) ТОГДА
//			|			ИСТИНА
//			|		ИНАЧЕ
//			|			ЛОЖЬ
//			|		КОНЕЦ КАК СписатьНаРасходы,
//			|//++ Гурьев 11.09.23 Комментарии к заказу
//			|	Товары.КАНАТ_КомментарийКЗаказу КАК КАНАТ_КомментарийКЗаказу,
//			|	Товары.КАНАТ_Сертификат КАК КАНАТ_Сертификат
//			|//-- Гурьев 11.09.23
//			|ИЗ
//			|	Товары КАК Товары
//			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК ВсеУпаковки
//			|		ПО ВсеУпаковки.Ссылка = Товары.Упаковка
//			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНДСНоменклатуры.СрезПоследних(&Период,
//			|			Страна = &СтранаРегистрации ИЛИ Страна = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) КАК СтавкиНДСНоменклатуры
//			|		ПО СтавкиНДСНоменклатуры.Номенклатура = Товары.Номенклатура 
//			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСтавкиНДС.СрезПоследних(&Период, Страна = &СтранаРегистрации) КАК ОсновныеСтавкиНДС
//			|		ПО ИСТИНА
//			|УПОРЯДОЧИТЬ ПО
//			|	НомерСтрокиВДокументе
//			|;
//			|
//			|////////////////////////////
//			|ВЫБРАТЬ
//			|	ВЫБОР
//			|		КОГДА МИНИМУМ(Товары.Склад) = МАКСИМУМ(Товары.Склад)
//			|			ТОГДА МИНИМУМ(Товары.Склад)
//			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
//			|	КОНЕЦ КАК ОдинСклад
//			|ИЗ
//			|	Товары КАК Товары
//			|ГДЕ
//			|	Товары.Склад ССЫЛКА Справочник.Склады И Товары.Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)";
//		
//	Иначе
//		Запрос.Текст =
//			"ВЫБРАТЬ
//			|	Товары.НомерСтрокиВДокументе КАК НомерСтрокиВДокументе,
//			|	Товары.Номенклатура КАК Номенклатура,
//			|	Товары.Характеристика КАК Характеристика,
//			|	Товары.Назначение КАК Назначение,
//			|	Товары.Упаковка КАК Упаковка,
//			|	Товары.КЗаказу КАК КЗаказу,
//			|	Товары.Склад КАК Склад,
//			|	Товары.Подразделение КАК Подразделение,
//			|	Товары.ДатаОтгрузки КАК ДатаОтгрузки
//			|ПОМЕСТИТЬ Товары
//			|ИЗ
//			|	&Товары КАК Товары
//			|ГДЕ
//			|	Товары.КЗаказу > 0
//			|ИНДЕКСИРОВАТЬ ПО
//			|   Номенклатура
//			|;
//			|
//			|///////////////////////////////////////////////
//			|ВЫБРАТЬ
//			|	Товары.НомерСтрокиВДокументе КАК НомерСтрокиВДокументе,
//			|	Товары.Номенклатура КАК Номенклатура,
//			|	Товары.Характеристика КАК Характеристика,
//			|	ЕСТЬNULL(СтавкиНДСНоменклатуры.СтавкаНДС, ЕСТЬNULL(ОсновныеСтавкиНДС.СтавкаНДС,
//			|		ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка))) КАК СтавкаНДС,
//			|	Товары.Назначение КАК Назначение,
//			|	Товары.Упаковка КАК Упаковка,
//			|	Товары.КЗаказу * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК Количество,
//			|	Товары.КЗаказу КАК КоличествоУпаковок,
//			|	Товары.Склад КАК Склад,
//			|	Товары.Подразделение КАК Подразделение,
//			|	Товары.ДатаОтгрузки КАК ДатаОтгрузки,
//			|	ВЫБОР КОГДА Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
//			|				Товары.Подразделение
//			|			ИНАЧЕ
//			|				Товары.Склад
//			|		КОНЕЦ КАК Получатель,
//			|	ВЫБОР КОГДА Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга) ТОГДА
//			|			ИСТИНА
//			|		ИНАЧЕ
//			|			ЛОЖЬ
//			|		КОНЕЦ КАК СписатьНаРасходы
//			|ИЗ
//			|	Товары КАК Товары
//			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК ВсеУпаковки
//			|		ПО ВсеУпаковки.Ссылка = Товары.Упаковка
//			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНДСНоменклатуры.СрезПоследних(&Период,
//			|			Страна = &СтранаРегистрации ИЛИ Страна = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) КАК СтавкиНДСНоменклатуры
//			|		ПО СтавкиНДСНоменклатуры.Номенклатура = Товары.Номенклатура 
//			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСтавкиНДС.СрезПоследних(&Период, Страна = &СтранаРегистрации) КАК ОсновныеСтавкиНДС
//			|		ПО ИСТИНА
//			|УПОРЯДОЧИТЬ ПО
//			|	НомерСтрокиВДокументе
//			|;
//			|
//			|////////////////////////////
//			|ВЫБРАТЬ
//			|	ВЫБОР
//			|		КОГДА МИНИМУМ(Товары.Склад) = МАКСИМУМ(Товары.Склад)
//			|			ТОГДА МИНИМУМ(Товары.Склад)
//			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
//			|	КОНЕЦ КАК ОдинСклад
//			|ИЗ
//			|	Товары КАК Товары
//			|ГДЕ
//			|	Товары.Склад ССЫЛКА Справочник.Склады И Товары.Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)";
//	КонецЕсли;
//	Запрос.Текст = СтрЗаменить(Запрос.Текст,
//		"&ТекстЗапросаКоэффициентУпаковки",
//		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
//		"ВсеУпаковки.Ссылка",
//		"Товары.Номенклатура"));
//		
//	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.Ссылка, "Дата, Организация");
//	Запрос.УстановитьПараметр("Товары", Товары.Выгрузить(Новый Структура("Отметка", Истина)));
//	Запрос.УстановитьПараметр("ДокументСсылка", Параметры.Ссылка);
//	Запрос.УстановитьПараметр("Период", ЗначенияРеквизитов.Дата);
//	Запрос.УстановитьПараметр("СтранаРегистрации", ЗначениеНастроекКлиентСерверПовтИсп.СтранаРегистрацииОрганизации(ЗначенияРеквизитов.Организация));
//	
//	Результаты = Запрос.ВыполнитьПакет();
//	ТаблицаТоваров = Результаты[Результаты.ВГраница() - 1].Выгрузить();
//	АдресТовары = ПоместитьВоВременноеХранилище(ТаблицаТоваров);
//	Выборка = Результаты[Результаты.ВГраница()].Выбрать();
//	ОдинСклад = Справочники.Склады.ПустаяСсылка();
//	Если Выборка.Следующий() Тогда
//		ОдинСклад = Выборка.ОдинСклад;
//	КонецЕсли;
//	
//	Возврат Новый Структура("АдресТовары,ОдинСклад", АдресТовары, ОдинСклад);
//КонецФункции

&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	ДействияСтрока = НСтр("ru = 'Все';
							|en = 'All'");
	ДействияСписок.Добавить(Перечисления.ВариантыОбеспечения.КОбеспечению,
		Перечисления.ВариантыОбеспечения.КОбеспечению, Истина);
	ДействияСписок.Добавить(Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления,
		Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления, Истина);
	ДействияСписок.Добавить(Перечисления.ВариантыОбеспечения.Отгрузить,
		Перечисления.ВариантыОбеспечения.Отгрузить, Истина);
	ДействияСписок.Добавить(Перечисления.ВариантыОбеспечения.СоСклада,
		Перечисления.ВариантыОбеспечения.СоСклада, Истина);
	ДействияСписок.Добавить(Перечисления.ВариантыОбеспечения.НеТребуется,
		Перечисления.ВариантыОбеспечения.НеТребуется, Истина);
	ДействияСписок.Добавить(Перечисления.ВариантыОбеспечения.ПереданРанее,
		Перечисления.ВариантыОбеспечения.ПереданРанее, Истина);
	ВосстановитьНастройки();
	
	//++ Гурьев 11.09.23
	Если ТипЗнч(Параметры.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		ДобавляемыеРеквизиты = Новый Массив;
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("КАНАТ_КомментарийКЗаказу",
															 Новый ОписаниеТипов("Строка"),
															 "Товары",
															 "Комментарий к заказу"));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("КАНАТ_Сертификат",
															 Новый ОписаниеТипов("СправочникСсылка.КАНАТ_Сертификаты"),
															 "Товары",
															 "Сертификат"));
		ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		НоваяКолонка = Элементы.Добавить("КАНАТ_ТоварыКомментарийКЗаказу", Тип("ПолеФормы"), Элементы.Товары); 
		НоваяКолонка.Заголовок = "Комментарий к заказу"; 
		НоваяКолонка.ПутьКДанным = "Товары.КАНАТ_КомментарийКЗаказу";
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		
		НоваяКолонка = Элементы.Добавить("КАНАТ_ТоварыСертификат", Тип("ПолеФормы"), Элементы.Товары); 
		НоваяКолонка.Заголовок = "Сертификаты"; 
		НоваяКолонка.ПутьКДанным = "Товары.КАНАТ_Сертификат";
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		
		КАНАТ_ЗаполнитьТоварыПоЗначениюПереключателяВсеИзДокументаНеОбеспечено_ЗаказКлиента();
	Иначе
		ЗаполнитьТоварыПоЗначениюПереключателяВсеИзДокументаНеОбеспечено();
	КонецЕсли;
	//-- Гурьев 11.09.23
КонецПроцедуры

Процедура КАНАТ_ЗаполнитьТоварыПоЗначениюПереключателяВсеИзДокументаНеОбеспечено_ЗаказКлиента()
	
	Если Параметры.ПараметрыОписаныВОбщемМодуле Тогда
		ПараметрыСоздания = ОбщегоНазначения.ВычислитьВБезопасномРежиме(Параметры.ИмяМенеджераДокумента
			+ ".ПараметрыСозданияНаОснованииОбеспечивающегоЗаказа()");
	Иначе
		ПараметрыСоздания = Документы[Параметры.ИмяМенеджераДокумента].ПараметрыСозданияНаОснованииОбеспечивающегоЗаказа();
	КонецЕсли;
	МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Параметры.Ссылка);
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	МенеджерДокумента.ТоварыДокументаДляСозданияОбеспечивающегоЗаказа(
		Параметры.Ссылка,
		ПараметрыСоздания,
		МенеджерВременныхТаблиц);
		
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Склады", Склад);
	Запрос.УстановитьПараметр("ВсеСклады", Не ЗначениеЗаполнено(Склад));
	ВариантыОбеспечения = ВариантыОбеспечения();
	Запрос.УстановитьПараметр("ВариантыОбеспечения", ВариантыОбеспечения);
	Запрос.УстановитьПараметр("ВсеДействия", ВариантыОбеспечения.Количество() = 0);

	Тексты = Новый Массив();
	Если ВсеИзДокументаНеОбеспечено = 0 Тогда // заполнение все из документа
		
		Текст =
			"ВЫБРАТЬ
			|	МИНИМУМ(Товары.НомерСтроки) КАК НомерСтрокиВДокументе,
			|	Товары.Номенклатура КАК Номенклатура,
			|	МИНИМУМ(Товары.Номенклатура.ТипНоменклатуры) КАК ТипНоменклатуры,
			|	Товары.Характеристика КАК Характеристика,
			|	Товары.Упаковка КАК Упаковка,
			|	Товары.Склад КАК Склад,
			|	Товары.Подразделение КАК Подразделение,
			|	Товары.Назначение КАК Назначение,
			|	Товары.ВариантОбеспечения КАК ВариантОбеспечения,
			|	Товары.Обособленно КАК Обособленно,
			|	Товары.ДатаОтгрузки КАК ДатаОтгрузки,
			|	СУММА(Товары.КоличествоПоДокументу) КАК КоличествоПоДокументу,
			|	ИСТИНА КАК Отметка,
			|	СУММА(Товары.КоличествоПоДокументу) КАК КЗаказу,
			|//++ Гурьев 11.09.23 Комментарии к заказу
			|	Товары.КАНАТ_КомментарийКЗаказу,
			|	Товары.КАНАТ_Сертификат 
			|//-- Гурьев 11.09.23
			|ИЗ
			|	ТоварыДокумента КАК Товары
			|ГДЕ
			|	(&ВсеСклады ИЛИ Товары.Склад В(&Склады))
			|		И (&ВсеДействия ИЛИ Товары.ВариантОбеспечения В(&ВариантыОбеспечения))
			|СГРУППИРОВАТЬ ПО
			|	Товары.Номенклатура,
			|	Товары.Характеристика,
			|	Товары.Упаковка,
			|	Товары.Склад,
			|	Товары.Подразделение,
			|	Товары.Назначение,
			|	Товары.ВариантОбеспечения,
			|	Товары.Обособленно,
			|	Товары.ДатаОтгрузки,
			|//++ Гурьев 11.09.23 Комментарии к заказу
			|	Товары.КАНАТ_КомментарийКЗаказу,
			|	Товары.КАНАТ_Сертификат 
			|//-- Гурьев 11.09.23
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтрокиВДокументе";
		Тексты.Добавить(Текст);
			
	Иначе // заполнение не обеспечено
		
		Текст =
			"ВЫБРАТЬ
			|	МИНИМУМ(Товары.НомерСтроки) КАК НомерСтроки,
			|	Товары.Номенклатура КАК Номенклатура,
			|	Товары.Характеристика КАК Характеристика,
			|	Товары.Склад КАК Склад,
			|	Товары.Подразделение КАК Подразделение,
			|	ВЫБОР
			|		КОГДА Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
			|			ТОГДА Товары.Подразделение
			|		ИНАЧЕ Товары.Склад
			|	КОНЕЦ КАК Отправитель,
			|	ВЫБОР
			|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Товары.Упаковка) = 1
			|			ТОГДА МАКСИМУМ(Товары.Упаковка)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
			|	КОНЕЦ КАК Упаковка,
			|	Товары.Назначение КАК Назначение,
			|	Товары.Обособленно КАК Обособленно,
			|//++ Гурьев 11.09.23 Комментарии к заказу
			|	Товары.КАНАТ_КомментарийКЗаказу,
			|	Товары.КАНАТ_Сертификат 
			|//-- Гурьев 11.09.23
			|ПОМЕСТИТЬ ТоварыСгруппированные
			|ИЗ
			|	ТоварыДокумента КАК Товары
			|ГДЕ
			|	(&ВсеСклады ИЛИ Товары.Склад В(&Склады))
			|		И Товары.ВариантОбеспечения В(
			|			ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления),
			|			ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению))
			|СГРУППИРОВАТЬ ПО
			|	Товары.Номенклатура,
			|	Товары.Характеристика,
			|	Товары.Склад,
			|	Товары.Подразделение,
			|	ВЫБОР
			|		КОГДА Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
			|			ТОГДА Товары.Склад
			|		ИНАЧЕ Товары.Подразделение
			|	КОНЕЦ,
			|	Товары.Назначение,
			|	Товары.Обособленно,
			|//++ Гурьев 11.09.23 Комментарии к заказу
			|	Товары.КАНАТ_КомментарийКЗаказу,
			|	Товары.КАНАТ_Сертификат 
			|//-- Гурьев 11.09.23
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура, Характеристика, Отправитель, Назначение";
			
		Тексты.Добавить(Текст);
		//Если РаспределениеЗапасов.ЭтоПроизводительныйРежим() Тогда  - уд. //Байков 2024 11 21 меняю метод под типовые куски из релиза (2.5.17.117), т.к. текущий код устарел и ссылается на несуществующие модули
			
			Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	Потребности.Номенклатура КАК Номенклатура,
				|	Потребности.Характеристика КАК Характеристика,
				|	Потребности.Склад КАК Склад,
				|	Потребности.Назначение КАК Назначение,
				|	Потребности.РезервироватьПоМереПоступленияОстаток
				|		+ Потребности.КОбеспечениюОстаток
				|		+ Потребности.ОтложитьРезервированиеОстаток КАК Требуется,
				|	ВЫБОР
				|		КОГДА Потребности.ВНаличииОстаток + Потребности.ЗаказаноОстаток - Потребности.РезервироватьНаСкладеОстаток
				|				> Потребности.РезервироватьПоМереПоступленияОстаток + Потребности.КОбеспечениюОстаток + Потребности.ОтложитьРезервированиеОстаток
				|			ТОГДА
				|				Потребности.РезервироватьПоМереПоступленияОстаток + Потребности.КОбеспечениюОстаток + Потребности.ОтложитьРезервированиеОстаток
				|		КОГДА Потребности.ВНаличииОстаток + Потребности.ЗаказаноОстаток - Потребности.РезервироватьНаСкладеОстаток < 0
				|			ТОГДА 0
				|		ИНАЧЕ
				|			Потребности.ВНаличииОстаток + Потребности.ЗаказаноОстаток - Потребности.РезервироватьНаСкладеОстаток
				|	КОНЕЦ КАК Обеспечено
				|ПОМЕСТИТЬ Потребности
				|ИЗ
				|	РегистрНакопления.ЗапасыИПотребности.Остатки(,
				|		(Номенклатура, Характеристика, Склад, Назначение) В(
				|			ВЫБРАТЬ
				|				Товары.Номенклатура КАК Номенклатура,
				|				Товары.Характеристика КАК Характеристика,
				|				Товары.Отправитель КАК Склад,
				|				Товары.Назначение КАК Назначение
				|			ИЗ
				|				ТоварыСгруппированные КАК Товары)) КАК Потребности
				|ИНДЕКСИРОВАТЬ ПО
				|	Номенклатура, Характеристика, Склад, Назначение";
			
		//Иначе         //Байков 2024 11 21 меняю метод под типовые куски из релиза (2.5.17.117), т.к. текущий код устарел и ссылается на несуществующие модули
		//	
		//	Текст =
		//		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//		|	Потребности.Номенклатура КАК Номенклатура,
		//		|	Потребности.Характеристика КАК Характеристика,
		//		|	Потребности.Склад КАК Склад,
		//		|	Потребности.Назначение КАК Назначение,
		//		|	СУММА(Потребности.РезервироватьПоМереПоступления
		//		|		+ Потребности.КОбеспечениюБезРезерва
		//		|		+ Потребности.ОтложитьРезервирование) КАК Требуется,
		//		|	ВЫБОР
		//		|		КОГДА СУММА(Потребности.Запас - Потребности.Резерв)
		//		|				> СУММА(
		//		|					Потребности.РезервироватьПоМереПоступления
		//		|						+ Потребности.КОбеспечениюБезРезерва
		//		|						+ Потребности.ОтложитьРезервирование)
		//		|			ТОГДА
		//		|				СУММА(
		//		|					Потребности.РезервироватьПоМереПоступления
		//		|						+ Потребности.КОбеспечениюБезРезерва
		//		|						+ Потребности.ОтложитьРезервирование)
		//		|		КОГДА СУММА(Потребности.Запас - Потребности.Резерв) < 0
		//		|			ТОГДА 0
		//		|		ИНАЧЕ
		//		|			СУММА(Потребности.Запас - Потребности.Резерв)
		//		|	КОНЕЦ КАК Обеспечено

		//		|ПОМЕСТИТЬ Потребности
		//		|ИЗ
		//		|	ТоварыСгруппированные КАК Товары
		//		|		
		//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК Потребности
		//		|		ПО Потребности.Номенклатура = Товары.Номенклатура
		//		|		 И Потребности.Характеристика = Товары.Характеристика
		//		|		 И Потребности.Склад = Товары.Отправитель
		//		|		 И Потребности.Назначение = Товары.Назначение
		//		|ГДЕ
		//		|	Потребности.Состояние В(
		//		|		ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемаяОтгрузка),
		//		|		ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе),
		//		|		ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление),
		//		|		ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ПоступлениеНеПодтвержденное))
		//		|СГРУППИРОВАТЬ ПО
		//		|	Потребности.Номенклатура,
		//		|	Потребности.Характеристика,
		//		|	Потребности.Склад,
		//		|	Потребности.Назначение
		//		|ИНДЕКСИРОВАТЬ ПО
		//		|	Номенклатура, Характеристика, Склад, Назначение";
		//	
	//	КонецЕсли;    
	
	
		//++ НЕ УТКА      //Байков 2024 11 21 добавляю типовой кусок из актуального релиза
		Если ПолучитьФункциональнуюОпцию("ДинамическаяСтруктураЗаказовНаПроизводство") Тогда
			Текст = СтрЗаменить(Текст, "ПОМЕСТИТЬ Потребности", "ПОМЕСТИТЬ ПотребностиПредварительные");
			Текст = Текст
				 + ОбщегоНазначения.РазделительПакетаЗапросов() +
				"ВЫБРАТЬ
				|	Потребности.Номенклатура КАК Номенклатура,
				|	Потребности.Характеристика КАК Характеристика,
				|	Потребности.Склад КАК Склад,
				|	Потребности.Назначение КАК Назначение,
				|	СУММА(Потребности.Требуется) КАК Требуется,
				|	СУММА(Потребности.Обеспечено) КАК Обеспечено
				|ПОМЕСТИТЬ Потребности
				|ИЗ
				|	(ВЫБРАТЬ
				|		Потребности.Номенклатура КАК Номенклатура,
				|		Потребности.Характеристика КАК Характеристика,
				|		Потребности.Склад КАК Склад,
				|		Потребности.Назначение КАК Назначение,
				|		Потребности.Требуется КАК Требуется,
				|		Потребности.Обеспечено КАК Обеспечено
				|	ИЗ
				|		ПотребностиПредварительные КАК Потребности
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		Потребности.Номенклатура,
				|		Потребности.Характеристика,
				|		Потребности.Склад,
				|		Потребности.Назначение,
				|		Потребности.Требуется,
				|		Потребности.РаспределеноИзЗапасов
				|			+ Потребности.РаспределеноИзЗапасовОбособленно
				|			+ Потребности.РаспределеноИзПартий
				|			+ Потребности.РаспределеноИзПартийОбособленно
				|	ИЗ
				|		РегистрСведений.СтруктураЗаказа КАК Потребности
				|	ГДЕ
				|		(Потребности.Номенклатура, Потребности.Характеристика, Потребности.Склад, Потребности.Назначение) В
				|				(ВЫБРАТЬ
				|					Товары.Номенклатура КАК Номенклатура,
				|					Товары.Характеристика КАК Характеристика,
				|					Товары.Отправитель КАК Склад,
				|					Товары.Назначение КАК Назначение
				|				ИЗ
				|					ТоварыСгруппированные КАК Товары)	
				|) КАК Потребности
				|
				|СГРУППИРОВАТЬ ПО
				|	Потребности.Назначение,
				|	Потребности.Номенклатура,
				|	Потребности.Характеристика,
				|	Потребности.Склад
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	Номенклатура, Характеристика, Склад, Назначение";
		КонецЕсли;
		//-- НЕ УТКА

		Тексты.Добавить(Текст);
		
		Текст =
			"ВЫБРАТЬ
			|	Товары.НомерСтроки КАК НомерСтрокиВДокументе,
			|	Товары.Номенклатура КАК Номенклатура,
			|	Товары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
			|	Товары.Характеристика КАК Характеристика,
			|	Товары.Упаковка КАК Упаковка,
			|	Товары.Склад КАК Склад,
			|	Товары.Подразделение КАК Подразделение,
			|	Товары.Назначение КАК Назначение,
			|	Товары.Обособленно КАК Обособленно,
			|	ЕСТЬNULL(Потребности.Требуется, 0) / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК Требуется,
			|	ЕСТЬNULL(Потребности.Обеспечено, 0) / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК Обеспечено,
			|	ЕСТЬNULL(Потребности.Требуется - Потребности.Обеспечено, 0) > 0 КАК Отметка,
			|	ЕСТЬNULL(Потребности.Требуется - Потребности.Обеспечено, 0) / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК КЗаказу,
			|//++ Гурьев 11.09.23 Комментарии к заказу
			|	Товары.КАНАТ_КомментарийКЗаказу,
			|	Товары.КАНАТ_Сертификат 
			|//-- Гурьев 11.09.23
			|ИЗ
			|	ТоварыСгруппированные КАК Товары
			|		
			|		ЛЕВОЕ СОЕДИНЕНИЕ Потребности КАК Потребности
			|		ПО Потребности.Номенклатура = Товары.Номенклатура
			|		 И Потребности.Характеристика = Товары.Характеристика
			|		 И Потребности.Склад = Товары.Отправитель
			|		 И Потребности.Назначение = Товары.Назначение
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтрокиВДокументе";
			
		Подстановка = Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"Товары.Упаковка", "Товары.Номенклатура");
		Текст = СтрЗаменить(Текст, "&ТекстЗапросаКоэффициентУпаковки", Подстановка);
		
		Тексты.Добавить(Текст);
	КонецЕсли;
	
	Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Товары.Склад КАК Ссылка
		|ИЗ
		|	ТоварыДокумента КАК Товары
		|ГДЕ
		|	Товары.Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)";
	Тексты.Добавить(Текст);
	
	Запрос.Текст = СтрСоединить(Тексты, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	УстановитьПривилегированныйРежим(Истина);
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	ТаблицаТовары = ПакетРезультатов[ПакетРезультатов.ВГраница() - 1].Выгрузить();
	МассивСкладов = ПакетРезультатов[ПакетРезультатов.ВГраница()].Выгрузить().ВыгрузитьКолонку("Ссылка");
	Элементы.Склад.СписокВыбора.ЗагрузитьЗначения(МассивСкладов);
	Товары.Загрузить(ТаблицаТовары);
	УправлениеВидимостью();
	
КонецПроцедуры;
